# Запрашиваем у пользователя параметры автомобиля по шаблону
params = input("Введите параметры автомобиля по шаблону\n")
avto = "LADA 2010г 205000км 450000руб"
parts = avto.split()

# Извлекаем параметры автомобиля
marka = parts[0]
god = parts[1]
probeg = parts[2]
cena = parts[3]

# Формируем вывод одной f-строкой с символами переноса строки
result = (f"Продается автомобиль\n"
          f"Марка: {marka}\n"
          f"Год выпуска: {god}\n"
          f"Пробег: {probeg}\n"
          f"Цена: {cena}")
if params == ("LADA 2010г 205000км 450000руб"):
    print(result)

else:
    print("Не верно введены параметры автомобиля.")
