while True:
    avto = input("Введите параметры автомобиля по шаблону ")
    print()
    avto1 = ('LADA 2010г 205000км 450000руб')
    avto2 = ('KIA 2017г 150000км 1100000руб')
    parts = avto2.split()
    if avto == (avto1):
        print(f'{avto1+" "+avto2} \n{'Продается автомобиль'} \n{'Марка:'} {parts[0]} \n{'Год выпуска:'} {parts[1]} \n{'Пробег:'} {parts[2]} \n{'Цена:'} {parts[3]} \n')
        break
    else:
        print("Не верно введены параметры автомобиля. Введите LADA 2010г 205000км 450000руб")


